Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: དེ་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་པ་ལས་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཆོས་ཀྱི་སྣང་བ་ཆེན་པོ་ཚད་མེད་པ་དང་། ཆོས་ཀྱི་འོད་ཆེན་པོ་དང་། ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་ཡང་དག་པར་འཛིན་ཏོ། །མོས་པར་བྱེད་དོ། །ཡང་དག་པར་ལེན་ཏོ། །བདག་གིར་བྱེད་དོ།
en: “In one instant, in one moment, he accepts, receives, acquires, and possesses an immeasurable great radiance, light, and clouds of the Dharma from countless buddha bhagavats in the ten directions.

source: རྒྱ་མཚོའི་ཀླུའི་རྒྱལ་པོའི་སྤྲིན་ལས་རྣམ་པར་བཀྱེ་བའི་ཆུའི་ཕུང་པོ་ཆེན་པོ་ནི་རྒྱ་མཚོ་ཆེན་པོ་མ་གཏོགས་པར་སའི་ཕྱོགས་གཞན་གྱིས་བཟོད་པ་འམ། བདག་གིར་བྱ་བ་འམ། བླང་བ་འམ། གཟུང་བར་མྱི་ནུས་སོ།
en: To give an analogy, it is like the great mass of water that is emanated from the clouds of an ocean’s nāga king, which can only be accepted, received, acquired, and possessed by the great ocean. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་གསང་བ་ལ་འཇུག་པ་དང་། ཆོས་ཀྱི་སྣང་བ་ཆེན་པོ་དང་། ཆོས་ཀྱི་འོད་ཆེན་པོ་དང་། ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་དེ་དག་ནི་སེམས་ཅན་ཐམས་ཅད་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་ས་དང་པོ་ཉེ་བར་བཟུང་བ་ཡན་ཅད། ས་དགུ་པའི་བར་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ཀྱང་བཟོད་པ་འམ། བླང་བ་འམ། ཡང་དག་པར་གཟུང་བ་འམ། བདག་གིར་བྱ་བ་སླ་བ་མ་ཡིན་ཏེ།
en: In that way all the secret processes, the great radiance, light, and clouds of the Dharma of the tathāgatas cannot be accepted, received, acquired, and possessed by any being, by any śrāvaka or pratyekabuddha, or by any bodhisattva up through the ninth bhūmi.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཆོས་ཀྱི་སྤྲིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་དག་ཐམས་ཅད་ལ་མོས་པར་བྱེད་དོ། །ཡང་དག་པར་ལེན་ཏོ། །ཡང་དག་པར་འཛིན་ཏོ། །བདག་གིར་བྱེད་དོ།
en: It is the bodhisattva on this bodhisattva bhūmi, Cloud of Dharma, who accepts, receives, acquires, and possesses them.

source: རྒྱ་མཚོ་ཆེན་པོ་ནི་ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་གཅིག་གིས་སྤྲིན་ཆེན་པོ་ཡང་བཟོད་དོ། །ལེན་ཏོ། འཛིན་ཏོ། །བདག་གིར་བྱེད་དོ། །ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་གཉིས་དང་། གསུམ་ནས་ཚད་མེད་པའི་བར་གྱི་སྤྲིན་ཆེན་པོ་དག་ཀྱང་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་གིས་བཟོད་དོ། །ལེན་ཏོ། །འཛིན་ཏོ། །བདག་གིར་བྱེད་དོ།
en: The great ocean can receive, acquire, and possess in one instant, in one moment, the great clouds of one great nāga king, of two great nāga kings, of three great nāga kings, and so on, up to the great clouds of countless great nāga kings.

source: རྒྱ་མཚོ་ཆེན་པོ་དེ་ཚད་མྱེད་པར་རྒྱ་ཆེ་ཞིང་ཡངས་པའི་ཕྱིར་རོ།
en: Because the great ocean is immeasurable, immense, and extensive. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་པས་ས་ཆོས་ཀྱི་སྤྲིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དེ་བཞིན་གཤེགས་པ་གཅིག་ལས་ཀྱང་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཆོས་ཀྱི་སྣང་བ་ཆེན་པོ་དང་། ཆོས་ཀྱི་འོད་ཆེན་པོ་དང་། ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་ཚད་མེད་པ་རྣམས་བཟོད་དོ། །ཡང་དག་པར་ལེན་ཏོ། །ཡང་དག་པར་འཛིན་ཏོ། །བདག་གིར་བྱེད་དོ། །དེ་བཞིན་གཤེགས་པ་གཉིས་དང་། གསུམ་ནས་ཚད་མེད་པའི་བར་དག་ལས་ཀྱང་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཆོས་ཀྱི་སྣང་བ་ཆེན་པོ་དང་། ཆོས་ཀྱི་འོད་ཆེན་པོ་དང་། ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་ཚད་མེད་པ་བཟོད་དོ། །ཡང་དག་པར་འཛིན་ཏོ། །ཡང་དག་པར་ལེན་ཏོ། །བདག་གིར་བྱེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ས་འདི་ཡང་ཆོས་ཀྱི་སྤྲིན་ཅེས་བྱའོ།
en: In that same way, the bodhisattva who on this bodhisattva bhūmi Cloud of Dharma can accept, receive, acquire, and possess in one instant, in one moment, the immeasurable great radiance, light, and clouds of the Dharma of one tathāgata, and in the same way he can accept, receive, acquire, and possess in one instant, in one moment, the immeasurable great radiance, great light, and clouds of the Dharma of two tathāgatas, of three tathāgatas, and so on, up to countless tathāgatas. That is why this bhūmi is called Cloud of Dharma.”

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་ལས་བྱང་ཆུབ་སེམས་དཔའ་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཆོས་ཀྱི་སྣང་བ་ཆེན་པོ་དང་། ཆོས་ཀྱི་འོད་ཆེན་པོ་དང་། ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་བཟོད་པར་བྱེད་པ་དང་། ཡང་དག་པར་འཛིན་པ་དང་། ཡང་དག་པར་ལེན་ཅིང་བདག་གིར་བྱེད་པ་དེ་དག་བགྲང་བར་ནུས་སམ།
en: Can one count the number of tathāgatas from whom the bodhisattva in one instant, in one moment, accepts, receives, acquires, and possesses immeasurable great Dharma light, great Dharma illumination, and great clouds of Dharma?”

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་བཞིན་གཤེགས་པ་འདི་སྙེད་ཅིག་ལས་བྱང་ཆུབ་སེམས་དཔའ་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཆོས་ཀྱི་སྣང་བ་ཆེན་པོ་དང་། ཆོས་ཀྱི་འོད་ཆེན་པོ་དང་། ཆོས་ཀྱི་སྤྲིན་ཆེན་པོ་བཟོད་ཅིང་ཡང་དག་པར་ལེན་པ་དང་། ཡང་དག་པར་འཛིན་ཅིང་བདག་གིར་བྱེད་དོ། །ཞེས་གྲངས་ཀྱིས་ཤིན་ཏུ་བསྟན་པའི་ཚུལ་དུ་བགྲང་བར་སླ་བ་མ་ཡིན་ཏེ།
en: One cannot count through numbering the tathāgatas from whom the bodhisattva in one instant, in one moment, accepts, receives, acquires, and possesses great Dharma light, great Dharma illumination, and great clouds of Dharma. “O jinaputras!

source: འོན་ཀྱང་དཔེ་ཙམ་དུ་བསྟན་པར་བྱའོ། །ཀྱེ་རྒྱལ་བའི་སྲས་འདི་ལྟ་སྟེ་དཔེར་ན།
en: I shall give you an analogy:

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་རྡུལ་ཕྲ་བ་སྙེད་ན་སེམས་ཅན་གྱི་ཁམས་མ་ལུས་པའི་ཚུལ་དུ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ལས། སེམས་ཅན་གཅིག་ཅིག་ཐོས་པ་འཛིན་པའི་གཟུངས་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏེ། འདི་ལྟ་སྟེ་དཔེར་ན། བཅོམ་ལྡན་འདས་རྡོ་རྗེ་པད་མོའི་བླ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་དགེ་སློང་རྣམ་པར་རྒྱལ་བ་ཆེན་པོ་ཞེས་བྱ་བ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་ཞམ་རིང་བ། ཉན་ཐོས་ཆེན་པོ་ཐོས་པ་འཛིན་པའི་མཆོག་ཏུ་ཕྱིན་པར་གྱུར་ལ། རྣམ་པ་དེ་ལྟ་བུའི་ཐོས་པ་འཛིན་པའི་སྟོབས་ཀྱི་ཤུགས་དང་། སེམས་ཅན་གཅིག་པོ་དེ་ལྡན་པར་གྱུར་ཏེ། སེམས་ཅན་གཅིག་པོ་དེ་ཅི་འདྲ་བ་དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཐམས་ཅད་ཀྱི་སེམས་ཅན་ཐམས་ཅད་ལྡན་པར་གྱུར་ལ། གཅིག་གིས་གང་བཟུང་བ་དེ་བཞིན་གྱིས་བཟུང་ན།
en: If there were realms of beings in all worlds as numerous as the atoms in countless quintillions of buddha realms in the ten directions, and if one being among them, who had attained the retention of remembering all that he heard, were to become a great śrāvaka attendant of the tathāgatas who was the highest among those with retention of what is heard, and through that power and might of being learned in what he had heard he became a bhikṣu named Mahāvijaya of the bhagavat tathāgata arhat samyak­sambuddha Vajra­padmottara, so that one being had become like that, and then if all beings in all realms without exception were to have the same attainment as that one being, and whatever one being retained no other being retained, then what do you think, jinaputra?

source: ཀྱེ་རྒྱལ་བའི་སྲས་དེ་ལ་ཇི་སྙམ་དུ་སེམས་སེམས་ཅན་དེ་དག་གི་ཐོས་པ་འཛིན་པའི་ཤེས་པ་དེ་དག་ཚད་མེད་ཅིང་མང་བ་ཡིན་མོད།
en: Would their learning through hearing be immeasurably numerous?”

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གྲོལ་བའི་ཟླ་བས་སྨྲས་པ།
en: The bodhisattva Vimukti­candra answered, “O jinaputra!

source: ཀྱེ་རྒྱལ་བའི་སྲས་སེམས་ཅན་དེ་དག་གི་ཐོས་པ་འཛིན་པའི་ཤེས་པ་དེ་ནི་མང་སྟེ་ཚད་ཀྱང་མྱེད་དོ།
en: The learning through hearing of all those beings would be immeasurable.”

source: ཀྱེ་རྒྱལ་བའི་སྲས་ཁྱོད་ཀྱིས་ཁོང་དུ་ཆུད་པ་དང་། ཡིད་ཆེས་པར་བྱ་ན་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་ཆོས་ཀྱི་སྤྲིན་འདི་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་དེ་བཞིན་གཤེགས་པ་གཅིག་ལས་ཀྱང་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཆོས་ཀྱི་སྣང་བ་དང་། འོད་དང་སྤྲིན་ཆེན་པོ་ཆོས་ཀྱི་དབྱིངས་དུས་གསུམ་གྱི་མཛོད་ཅེས་བྱ་བ་བཟོད་ཅིང་ཡང་དག་པར་ལེན་ཏོ།
en: I declare to you and reply to you that the bodhisattva on this bodhisattva bhūmi Cloud of Dharma can accept, receive, acquire, and possess in one instant, in one moment, from a tathāgata, the great radiance, light, and clouds of the Dharma, which is called the treasure of the three times of the realm of phenomena

source: །ཡང་དག་པར་འཛིན་ཏོ། །བདག་གིར་བྱེད་དོ། །ཆོས་ཀྱི་སྣང་བ་དང་། འོད་དང་སྤྲིན་ཆེན་པོ་ཡང་དག་པར་འཛིན་པའི་ཤེས་པ་དེ་ལ་ཐོས་པ་འཛིན་པའི་ཤེས་པ་སྔ་མས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: Compared to what is learned through the retention of the great radiance, light, and clouds of the Dharma, previous learning through hearing is not even a hundredth of it, not even a thousandth, a hundred thousandth, a ten millionth, a billionth, a ten billionth, a trillionth, or even a quintillionth of it. Previous learning cannot be correlated to it through numbers, enumeration, comparison, resemblance, or similitude.

source: །སྟོང་གི་ཆ་དང་། བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་། བྱེ་བའི་ཆ་དང་བྱེ་བ་བརྒྱའི་ཆ་དང་། བྱེ་བ་སྟོང་གི་ཆ་དང་། བྱེ་བ་བརྒྱ་སྟོང་གི་ཆ་དང་། བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་ཆ་དང་། གྲངས་དང་། ཆ་དང་། བགྲང་བ་དང་། དཔེ་དང་། རྒྱུར་ཡང་ཉེ་བར་མྱི་འགྲོ་བ་ནས་བསྒྲུན་པ་ཙམ་གྱི་བར་དུ་འང་མྱི་ཆོག་གོ །དེ་བཞིན་གཤེགས་པ་གཅིག་ལས་ཇི་ལྟ་བ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་སྔ་མ་དག་ན་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཡོད་པ་དེ་སྙེད་ཀྱི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་དང་། དེ་དག་བས་ཀྱང་ཆེས་མང་ཞིང་ཚད་མེད་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལས་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཆོས་ཀྱི་སྣང་བ་དང་། འོད་དང་སྤྲིན་ཆེན་པོ་ཆོས་ཀྱི་དབྱིངས་དུས་གསུམ་གྱི་མཛོད་ཅེས་བྱ་བ་བཟོད་ཅིང་ཡང་དག་པར་ལེན་ཏོ། །ཡང་དག་པར་འཛིན་ཏོ། །བདག་གིར་བྱེད་དོ།
en: “Just as from one tathāgata, from as many buddhas as there are atoms in the previously described worlds in the ten directions, and even from immeasurably more tathāgatas, he can accept, possess, acquire, and hold in one instant, in one moment, the great radiance, light, and clouds of the Dharma, which are called the treasure of the three times of the realm of phenomena

source: །དེ་བས་ནས་འདི་ཡང་ཆོས་ཀྱི་སྤྲིན་ཅེས་བྱའོ།
en: That is why this bhūmi is called Cloud of Dharma. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ས་ཆོས་ཀྱི་སྤྲིན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་རང་གི་སྨོན་ལམ་གྱི་སྟོབས་དང་ཤུགས་ཀྱིས་སྙིང་བརྩེ་བ་དང་སྙིང་རྗེ་ཆེན་པོའི་སྤྲིན་ཆོས་ཀྱི་སྣང་བ་ཆེན་པོ་རབ་ཏུ་སྒྲོག་པའི་འབྲུག་སྒྲ་ཤིན་ཏུ་སྒྲོག་པ་མངོན་པར་ཤེས་པ་དང་། རིག་པ་དང་མྱི་འཇིགས་པའི་གློག་རྣམ་པར་འགྱུ་བ། འོད་གཟེར་ཆེན་པོའི་རླུང་གིས་ཤིན་ཏུ་བསྐྱོད་པ། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་སྤྲིན་གྱི་དྲ་བ་སྟུག་པོས་ཀུན་ནས་ཁེབས་པ། ལུས་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱི་ཀློང་ཡང་དག་པར་སྟོན་པ། ཆོས་ཀྱི་སྒྲ་ཆེན་པོ་རབ་ཏུ་སྒྲོག་པ། བདུད་ཀྱི་འཁོར་ཐམས་ཅད་ཤིན་ཏུ་ཚར་གཅོད་པ། ཡོངས་སུ་བསླང་སྟེ། སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་སྔ་མ་དེ་དག་ན་རྡུལ་ཕྲ་རབ་ཇི་སྙེད་ཡོད་པ་དེ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དང་། དེ་དག་བས་ཀྱང་ཆེས་མང་ཞིང་ཚད་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་རྒྱས་པར་བཀང་སྟེ། དགེ་བའི་བདུད་རྩིའི་རྒྱུན་གྱི་ཆར་ཆེན་པོས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་རྣམས་ཀྱི་མྱི་ཤེས་པ་ལས་ལངས་པའི་ཉོན་མོངས་པའི་རྡུལ་གྱི་མེ་ལྕེ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་དེ།
en: Moreover, the bodhisattva who is on this bodhisattva bhūmi Cloud of Dharma, through the power and might of their prayers raise up clouds of great compassion, the thunder of the radiance of the Dharma, the flashing lightning of clairvoyance, knowledge, and confidence, the blowing winds of great light rays, the overarching network of massed clouds of merit and wisdom, the manifestation of a whirling mass of all kinds of bodies, the great resounding of the Dharma, and all the routing of the followers of Māra . He pervades in one instant, in one moment, countless quintillions of worlds, as numerous as the atoms in the previously described worlds in the ten directions, and pervades even more, countless quintillions of worlds, and with the great rain that has the nectar of good actions he eliminates as wished for all the dust and fire of the kleśas that arise from the ignorance of beings.

source: དེ་བས་ནས་འདིའང་ཆོས་ཀྱི་སྤྲིན་ཅེས་བྱའོ།
en: That is why this bhūmi is called Cloud of Dharma. “O jinaputras!

source: །ཀྱེ་རྒྱལ་བའི་སྲས་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ས་ཆོས་ཀྱི་སྤྲིན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་ཡང་དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་པ་ནས་བཟུང་སྟེ།
en: Moreover, the bodhisattva who is on this bodhisattva bhūmi Cloud of Dharma attains the activities of all tathāgatas in one world in accordance with the wishes of beings who are to be guided:

source: འཕོ་བ་དང་ཡུམ་གྱི་སྐུར་བཞུད་པ་དང་། སྐུ་ན་བཞུགས་པ་དང་། ཚེ་དང་མངོན་པར་འབྱུང་བ་དང་། མངོན་པར་འཚང་རྒྱ་བ་དང་། གསོལ་བ་གདབ་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་ཆེན་པོ་བསྐོར་བ་དང་། མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་བསྟན་པའི་བར་དུ་སེམས་ཅན་གྱི་བསམ་པའི་ཚུལ་དང་། འདུལ་བའི་ཚུལ་ཇི་ལྟ་བ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ཐམས་ཅད་བྱིན་གྱིས་རློབ་བོ།
en: dwelling in the perfect palace of Tuṣita, passing away and descending, being in a womb, being born, renouncing, attaining enlightenment, being requested to teach, turning the Dharma wheel and the level of the great nirvāṇa.

source: །དེ་བཞིན་དུ་འཇིག་རྟེན་གྱི་ཁམས་གཉིས་ནས་འཇིག་རྟེན་གྱི་ཁམས་སྔ་མ་དེ་དག་ན་རྡུལ་ཕྲ་རབ་ཇི་སྙེད་ཡོད་པ་དེ་དག་བས་ཀྱང་ཆེས་མང་བའི་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་པའི་བར་དག་ཏུ་ཡང་དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་པ་ནས་བཟུང་སྟེ།
en: In the same way, in two worlds and so on, up to worlds as numerous as the atoms in the previously described universes in the ten directions, and even more countless quintillions of worlds, he attains the activities of all tathāgatas in accordance with the wishes of beings who are to be guided:

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་བསྟན་པའི་བར་དུ་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པའི་ཚུལ་དང་། འདུལ་བའི་ཚུལ་ཇི་ལྟ་བ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་ཐམས་ཅད་བྱིན་གྱིས་རློབ་བོ།
en: dwelling in the perfect palace of Tuṣita and so on, up to the level of the great nirvāṇa.

source: །དེ་དེ་ལྟ་བུའི་ཡེ་ཤེས་དང་ལྡན་ཞིང་ཤིན་ཏུ་བརྟགས་པའི་མངོན་པར་ཤེས་པ་ཆེན་པོ་ཐོབ་པས། འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་དོག་པ་ཡངས་པར་བྱིན་གྱིས་རློབ་བོ། །ཡངས་པ་ཡང་དོག་པར་བྱིན་གྱིས་རློབ་བོ། །འདོད་ན་ཀུན་ནས་ཉོན་མོངས་པ་རྣམ་པར་དག་པར་བྱིན་གྱིས་རློབ་བོ། །རྣམ་པར་དག་པ་ཀུན་ནས་ཉོན་མོངས་པར་བྱིན་གྱིས་རློབ་བོ།
en: “The one who has attained that miraculous power of wisdom and has the clairvoyance and great wisdom of discrimination can, as he wishes, transform an afflicted world into a pure world, transform a pure world into an afflicted world, transform a narrow world into a wide world, and transform a wide world into a narrow world.

source: །དེ་བཞིན་དུ་རྒྱ་ཆེན་པོ་དང་ཤིན་ཏུ་ཡངས་པ་དང་། ཚད་མེད་པ་དང་། ཕྲ་བ་དང་། ཐ་གྲུ་ཆེན་པོ་དང་། སྣྲེལ་ཞི་དང་། སྤྱིའུ་ཚུགས་དང་། གཞི་མཉམ་པ་ལ་སོགས་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱང་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བས་མངོན་པར་བསྒྲུབ་པ་དེ་དང་དེར་བྱིན་གྱིས་རློབ་བོ།
en: In the same way, through his supremacy he transforms, as he intends, all worlds—the vast, great, immeasurable, minute, huge, inverted, upside-down, level, and so on.

source: །དེ་འདོད་ན་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་གཅིག་ལ་འཇིག་རྟེན་གྱི་ཁམས་ཁོར་ཡུག་གི་འོབས་དང་བཅས་པ་རྣམ་པ་ཐམས་ཅད་དང་ལྡན་པ་གཅིག་ཀྱང་བྱིན་གྱིས་རློབ་སྟེ།
en: “As he wishes, he can transform one atom into an entire world with its Cakravāḍa mountain range and surrounding ocean.

source: རྡུལ་ཤིན་ཏུ་ཕྲ་བ་དེའང་མྱི་འཕེལ་ལ་བྱ་བ་དེ་དག་ཀྱང་ཡོངས་སུ་སྟོན་ཏོ།
en: He manifests that activity without that atom growing any larger.

source: །རྡུལ་ཤིན་ཏུ་ཕྲ་བ་གཅིག་ལ་འཇིག་རྟེན་གྱི་ཁམས་གཉིས་དང་གསུམ་དང་བཞི་དང་ལྔ་ནས་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་བར་དུ་ཐམས་ཅད་ཀྱང་ཁོར་ཡུག་གི་འོབས་དང་བཅས་པ་རྣམ་པ་ཐམས་ཅད་དང་ལྡན་པར་བྱིན་གྱིས་རློབ་སྟེ། རྡུལ་ཤིན་ཏུ་ཕ་བ་དེ་ཡང་མི་འཕེལ་ལ་བྱ་བ་དེ་དག་ཀྱང་ཡོངས་སུ་སྟོན་ཏོ། །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་གཉིས་ཀྱི་རྒྱུན་ཡོངས་སུ་སྟོན་ཏོ།
en: “He can transform one atom to become two worlds, three worlds, four worlds, five worlds, and so on, up to countless worlds, entire worlds with all their atoms, and their Cakravāḍa mountain ranges and surrounding oceans, without that atom growing any larger.

source: །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་བར་གྱི་རྒྱུན་ཡོངས་སུ་སྟོན་ཏོ། །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་གི་རྒྱན་འཇིག་རྟེན་གྱི་ཁམས་གཉིས་སུ་ཡོངས་སུ་སྟོན་ཏོ། །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པ་དག་ཏུ་ཡང་ཡོངས་སུ་སྟོན་ཏོ། །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པ་དག་ན། སེམས་ཅན་གྱི་ཁམས་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ཏུ་སྡུད་དེ་སེམས་ཅན་དེ་དག་ལ་ཡང་གནོད་པར་མྱི་འགྱུར་རོ།
en: “As he wishes, he can manifest two worlds in one world, and so on, up to manifesting countless worlds in one world. As he wishes, he can place all the realms of beings in those countless worlds into one world without causing harm to those beings.

source: །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་ན་སེམས་ཅན་གྱི་ཁམས་ཅི་སྙེད་པ་དེ་དག་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པར་སྡུད་དེ། སེམས་ཅན་དེ་དག་ལ་ཡང་གནོད་པར་མྱི་འགྱུར་རོ།
en: As he wishes, he can place all the beings in one world in countless worlds without causing harm to those beings.

source: །འདོད་ན་སྐྲའི་རྩེ་མོ་གཅིག་ལ་སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་རྒྱན་རྣམ་པ་ཐམས་ཅད་དང་ལྡན་པ་གཅིག་སྟོན་ཏོ།
en: As he wishes, he can place all the beings in countless worlds within a single body hair. As he wishes, he can manifest the entire display of a single buddha realm within a single body hair, and so on.

source: །འདོད་ན་སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་རྒྱན་རྣམ་པ་ཐམས་ཅད་དང་ལྡན་པ་བརྗོད་དུ་མེད་པའི་བར་དུ་སྟོན་ཏོ།
en: As he wishes, he can do so up to the entire appearances of the displays of countless buddha realms.

source: །འདོད་ན་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པ་དག་ན་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ཇི་སྙེད་ཡོད་པ་དེ་སྙེད་ཀྱི་ལུས་སྐད་ཅིག་ཡུད་ཙམ་ཐང་ཅིག་ཏུ་ཤིན་ཏུ་སྤྲུལ་པ་བྱེད་དོ།
en: “As he wishes, he can emanate in one instant, in one moment, as many of his bodies as there are atoms in countless worlds.

source: །ལུས་རེ་རེ་ལ་ཡང་དེ་སྙེད་ཀྱི་ལག་པ་ཡོངས་སུ་སྟོན་ཏེ།
en: He manifests that number of hands on each body.

source: ལག་པ་དེ་དག་གིས་ཀྱང་ཕྱོགས་བཅུར་སངས་རྒྱས་མཆོད་པ་རབ་ཏུ་བྱེད་དེ།
en: Those hands make offerings to the buddhas in the ten directions.

source: ལག་པ་རེ་རེས་ཀྱང་མེ་ཏོག་གི་ཕུང་པོ་ཆུ་ཀླུང་གང་གཱའི་བྱེ་མ་སྙེད་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལ་མངོན་པར་འཐོར་རོ།
en: Each of those hands scatters as many bags of flowers as there are grains of sand in the Ganges River toward the buddhas, the bhagavats.

source: །མེ་ཏོག་ཇི་ལྟ་བ་དེ་བཞིན་དུ་སྤོས་དང་། ཕྲེང་བ་དང་བྱུག་པ་དང་། ཕྱེ་མ་དང་། ན་བཟའ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། དེ་བཞིན་དུ་རྒྱན་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་འབུལ་ལོ།
en: They also offer incense, garlands, perfumes, powders, clothing, parasols, victory banners, flags, and all adornments in the same number as that of the flowers.

source: །ལུས་རེ་རེ་ལ་ཡང་དེ་སྙེད་ཀྱི་མགོ་བྱིན་གྱིས་རློབ་ཅིང་མགོ་རེ་རེ་ལ་ཡང་དེ་སྙེད་ཀྱི་ལྕེ་བྱིན་གྱིས་བརླབས་ཏེ།
en: He manifests that number of heads on each body. He manifests that number of tongues in each head.

source: དེ་དག་གིས་ཀྱང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཡོན་ཏན་ཤིན་ཏུ་བརྗོད་པ་བྱེད་དོ།
en: They utter praises to the buddhas, the bhagavats.

source: །སེམས་བསྐྱེད་པ་རེ་རེ་ལ་ཡང་ཕྱོགས་བཅུ་རྒྱས་པར་ཁྱབ་པར་འགྲོ་སྟེ།
en: “Each development of bodhicitta pervades the ten directions.

source: སེམས་བསྐྱེད་པ་ཙམ་གྱིས་ཀྱང་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ཚད་མེད་པ་ནས། མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་རྒྱན་གྱི་བར་དུ་བྱིན་གྱིས་རློབ་བོ།
en: That development of bodhicitta alone manifests countless attainments of buddhahood and so on, up to entering the great nirvāṇa.

source: །དུས་གསུམ་གྱི་ལུས་ཆད་མེད་པ་ཡང་བྱིན་གྱིས་རློབ་སྟེ།
en: “He manifests countless bodies in the three times.

source: རང་གི་ལུས་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཆད་མེད་པ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་དང་རྒྱན་ཚད་མེད་པ་བྱིན་གྱིས་རློབ་བོ།
en: He manifests in his own body innumerable displays of the qualities of the buddha realms of countless buddha bhagavats.

source: །འཇིག་རྟེན་གྱི་ཁམས་འཇིག་པ་དང་། འདུ་བ་ཐམས་ཅད་ཀྱང་རང་གི་ལུས་ལ་བྱིན་གྱིས་རློབ་བོ།
en: He also manifests in his own body the creation and destruction of all worlds.

source: །རླུང་གི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཀྱང་བ་སྤུའི་ཁུང་བུ་གཅིག་ནས་གཏོང་སྟེ། སེམས་ཅན་རྣམས་ལ་ཡང་གནོད་པར་མི་བྱེད་དོ།
en: He emits all winds from one pore without causing harm to beings.

source: །འདོད་ན་ཆུའི་ཕུང་པོ་ཡན་ཅད་འཇིག་རྟེན་གྱི་ཁམས་གཅིག་བྱིན་གྱིས་རློབ་བོ།
en: If he wishes to, he manifests a world that is an extensive mass of water.

source: །དེར་ཡང་པད་མོ་ཆེན་པོ་བྱིན་གྱིས་རློབ་བོ།
en: He manifests a great lotus upon it.

source: །པད་མོ་ཆེན་པོ་དེའི་འོད་རྣམ་པར་ཕྱེ་བས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་མུ་མེད་པ་རྒྱས་པར་གང་བར་བྱེད་དོ།
en: The endless display of the brilliant light of that lotus shines on all worlds.

source: །དེ་ལ་ཡང་བྱང་ཆུབ་ཀྱི་ཤིང་ཆེན་པོ་ཡོངས་སུ་སྟོན་པ་ནས།
en: He manifests there a great bodhi tree, and so on, up to displaying omniscience that is superior to all.

source: རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པའི་ཐམས་ཅད་མཁྱེན་པའི་བར་དུ་ཡང་དག་པར་སྟོན་ཏོ། །རང་གི་ལུས་ལ་ཕྱོགས་བཅུའི་ནོར་བུ་དང་། གློག་དང་ཉི་ཟླའི་འོད་བྱིན་གྱིས་རློབ་པ་ནས། སྣང་བ་དང་འོད་ཐམས་ཅད་ཀྱི་བར་དུ་བྱིན་གྱིས་རློབ་བོ།
en: “He manifests in his own body all the light of jewels, lightning, the moon, and the sun in the ten directions, and so on, up to every kind of brightness and light.

source: །ཁའི་དབུགས་ཀྱིས་ཀྱང་ཕྱོགས་རེ་རེའི་འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་པ་གཡོ་བར་བྱེད་དེ། སེམས་ཅན་རྣམས་འཇིགས་པར་ཡང་མི་བྱེད་དོ།
en: One wind from his mouth shakes the endless worlds in each of the ten directions, without his causing beings to be afraid.

source: །ཕྱོགས་བཅུར་རླུང་གིས་འཇིག་པ་དང་། མྱེས་འཇིག་པ་དང་། ཆུས་འཇིག་པ་ཡང་བྱིན་གྱིས་རློབ་ལ།
en: “He displays the destruction of worlds in the ten directions by wind, their destruction by fire, and their destruction by water.

source: འདོད་ན་སེམས་ཅན་ཐམས་ཅད་བསམ་པ་བཞིན་དུ་གཟུགས་ཀྱི་ལུས་དང་། གནས་ཡོངས་སུ་རྒྱན་པར་བྱིན་གྱིས་རློབ་བོ།
en: If he wishes to, he displays the adornment of physical bodies in accordance with the aspirations of all beings.

source: །རང་གི་ལུས་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་བྱིན་གྱིས་རློབ་བོ།
en: He displays the body of a tathāgata in his own body.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་རང་གི་ལུས་བྱིན་གྱིས་རློབ་བོ།
en: He displays his own body in a tathāgata’s body.

source: །དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་བྱིན་གྱིས་རློབ་བོ།
en: He displays his own buddha realm in the body of the tathāgata.

source: །རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་བྱིན་གྱིས་རློབ་བོ།
en: He displays the body of a tathāgata in his own buddha realm.

source: །ཀྱེ་རྒྱལ་བའི་སྲས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་ཆོས་ཀྱི་སྤྲིན་ལ་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པ་འདི་དག་དང་། གཞན་ཡང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཚད་མེད་པ་ཡོངས་སུ་སྟོན་ཏོ།
en: “O jinaputras! The bodhisattva on this bodhisattva bhūmi Cloud of Dharma displays these and other innumerable countless quintillions of miraculous powers and miraculous manifestations.”

source: །དེ་ནས་འཁོར་དེའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ལ་དང་། ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་གྱི་མགོན་པོ་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། གཙང་མའི་གནས་སུ་གཏོགས་པ་ཁ་ཅིག་འདི་སྙམ་དུ་སེམས་ཏེ། དེ་ལྟར་དེ་སྟེ་བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་བྱ་བའི་སྤྱོད་ཡུལ་ཡང་དེ་ལྟར་ཚད་མེད་ན།
en: Then among that assembly some bodhisattvas and some devas, nāgas, yakṣas, gandharvas, asuras, Śakra devas, Brahmā devas, lokapālas, Maheśvara devas, and Śuddhāvāsa devas thought, “If the bodhisattva has that kind of immeasurable range of conduct of creating miracles, then what are the miracles of the tathāgatas like?”

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་རྫུ་འཕྲུལ་གྱི་རྣམ་པ་ཅི་འདྲ་བ་ཞིག་ཡོད་སྙམ་པ་དང་། དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་གྲོལ་བའི་ཟླ་བས་འཁོར་དེ་དག་གི་སེམས་དང་བསམ་པའི་རྒྱུད་ཤེས་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀྱེ་རྒྱལ་བའི་སྲས་འཁོར་འདི་དག་ཐེ་ཙོམ་དུ་གྱུར་ན།
en: Then the bodhisattva Vimukti­candra, knowing the thoughts and uncertainties of that assembly, said to the bodhisattva Vajra­garbha, “O jinaputra!

source: དེ་དག་གི་ཐེ་ཙོམ་གཅོད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའི་ཆོ་འཕྲུལ་རྣམ་པར་ཕྱེ་བ་ཆུང་ཟད་ཅིག་མི་བསྟན་ཏམ།། །།སངས་རྒྱས་རྨད་ག་ཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། བམ་པོ་ཉི་ཤུ་གཅིག་པ།
en: This assembly has uncertainties, and so in order to eliminate their uncertainties show us a little of a bodhisattva’s display of miracles.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་ལྷུན་དང་། རང་བཞིན་ཡང་དག་པར་སྟོན་པ་ཞེས་བྱ་བ་ལ་སྙོམས་པར་ཞུགས་སོ།
en: Then at that time the bodhisattva Vajra­garbha entered the bodhisattva samādhi called revealing the nature of the body of the buddha realms
